[Killed] ObjectLiteral
Jest/desafio4/src/mongo-cliente.js:16:17
         return new Promise((resolve,reject) => {
             mongodb.MongoClient.connect(
                 'mongodb://localhost:27017/', 
-                { useNewUrlParser: true },
+                {},
                 (err, client) => {
                     if(err) {

[Killed] ConditionalExpression
Jest/desafio4/src/mongo-cliente.js:18:24
                 'mongodb://localhost:27017/', 
                 { useNewUrlParser: true },
                 (err, client) => {
-                    if(err) {
+                    if(true) {
                         reject(err);
                     }
