[Killed] StringLiteral
Jest/desafio4/src/repositorio.js:8:53
     }
     
     async findAllFiles() {
-        const files = await this.cliente.collection('files').find({}).toArray();
+        const files = await this.cliente.collection("").find({}).toArray();
         return files;
     }
